<a href="https://colab.research.google.com/github/0x31nose/python_tutorial_with_Colab/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas

In [2]:
import pandas as pd
import numpy as np

## Series

In [3]:
# dictionaryからSeriesを作る
data = {
    'Name': 'John',
    'Sex': 'male',
    'Age': 22
}

In [4]:
pd.Series(data)

Name    John
Sex     male
Age       22
dtype: object

In [5]:
# NumPy Arrayから作成
# NumPyArrayで作成する場合はインデックスが振られる。（0から3）
array = np.array([22, 31, 42, 23])
age_series = pd.Series(array)

In [6]:
# インデックス番号だと扱いづらいのでラベルをつける
array = np.array(['John', 'male', 22])
# Seriesのラベルを指定して値を取り出す
john_series = pd.Series(array, index=['Name', 'Sex', 'Age'])
# 指定したラベルで取り出す
john_series['Name']

'John'

In [7]:
# .valuesで値をNumpyとして扱うことが出来る
age_series.values

array([22, 31, 42, 23])

In [8]:
# Numpyと同じように統計量を計算可能
age_series.mean()

29.5

### DataFrame

In [9]:
# Numpy Array から作成
ndarray = np.arange(10).reshape(2, 5)
ndarray

array([[0, 1, 2, 3, 4],
       [5, 6, 7, 8, 9]])

In [12]:
# index=[] で行のインデックスを指定可能
# columns=[] で列のインデックスを指定可能
#　文字列で指定しないと、０から始まるインデックスが自動的に割り振られる
pd.DataFrame(ndarray, index= ['index1', 'index2'], columns=['a', 'b', 'c', 'd', 'e'])

        a  b  c  d  e
index1  0  1  2  3  4
index2  5  6  7  8  9

In [17]:
# DictionaryからDataFrameを作成する
data1 = {
    'name': 'John',
    'sex': 'male',
    'age': 22,
}
data2 = {
    'name': 'Hanako',
    'sex': 'female',
    'age': 29,
}
data3 = {
    'name': 'Alex',
    'sex': 'male',
    'age': 20,
}
data4 = {
    'name' : 'Corina',
    'sex' : 'female',
    'age' : 25,
}
# pd.DataFrame内にリスト形式で入れると、上記と同じように表形式に整理できる
# 行のインデックスを指定していないので、０から始まるインデックスで指定されていることがわかる
# この書き方だと、レコード数が多くなると書き方が大変

pd.DataFrame([data1, data2, data3, data4])

     name     sex  age
0    John    male   22
1  Hanako  female   29
2    Alex    male   20
3  Corina  female   25

In [23]:
#　DictionaryのValueをインデックスとすることも出来て、作成が楽。
data = {
    'name': ['Jack', 'Eitan', 'Laura', 'Briana'],
    'sex': ['male', 'male', 'female', 'female'],
    'age': [34, 45, 25, 23],
}
# DataFrameのデータ量は大きくなりがち。何十万から何百万のデータになってしまう。
# 一つのコードの中で複数のDatFrameを入れることが難しくなる（メモリが溢れてしまう）
# そのため、dfという変数を使い回すことが多い。
df = pd.DataFrame(data)
df

     name     sex  age
0    Jack    male   34
1   Eitan    male   45
2   Laura  female   25
3  Briana  female   23

In [27]:
# csvからデータを読み込んでDataFrameに使っていく。
# .head()で表の上から５件のレコードを表示することが出来る。
df = pd.read_csv('/content/sample_data/tmdb_5000_movies.csv')
df.head(5)

      budget  ... vote_count
0  237000000  ...      11800
1  300000000  ...       4500
2  245000000  ...       4466
3  250000000  ...       9106
4  260000000  ...       2124

[5 rows x 20 columns]